pkg/wsman/wsmantesting/responses/ips/ipv6portsettings/get.xml

<?xml version="1.0" encoding="UTF-8"?>
<a:Envelope xmlns:a="http://www.w3.org/2003/05/soap-envelope"
    xmlns:b="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:c="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/02/trust"
    xmlns:e="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:f="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd"
    xmlns:g="http://intel.com/wbem/wscim/1/ips-schema/1/IPS_IPv6PortSettings"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <a:Header>
        <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
        <b:RelatesTo>0</b:RelatesTo>
        <b:Action a:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</b:Action>
        <b:MessageID>uuid:00000000-8086-8086-8086-0000000002A1</b:MessageID>
        <c:ResourceURI>http://intel.com/wbem/wscim/1/ips-schema/1/IPS_IPv6PortSettings</c:ResourceURI>
    </a:Header>
    <a:Body>
        <g:IPS_IPv6PortSettings>
            <g:CurrentDefaultRouter>::</g:CurrentDefaultRouter>
            <g:CurrentPrimaryDNS>::</g:CurrentPrimaryDNS>
            <g:CurrentSecondaryDNS>::</g:CurrentSecondaryDNS>
            <g:DefaultRouter>::</g:DefaultRouter>
            <g:ElementName>Intel(r) IPS IPv6 Settings 0</g:ElementName>
            <g:IPv6Address>::</g:IPv6Address>
            <g:InstanceID>Intel(r) IPS IPv6 Settings 0</g:InstanceID>
            <g:InterfaceIDType>0</g:InterfaceIDType>
            <g:ManualInterfaceID>0000000000000000</g:ManualInterfaceID>
            <g:PrimaryDNS>::</g:PrimaryDNS>
            <g:SecondaryDNS>::</g:SecondaryDNS>
        </g:IPS_IPv6PortSettings>
    </a:Body>
</a:Envelope>